In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30
float_formatter = "฿{:,.2f}"

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 9, 1), datetime.date(2023, 8, 31))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 9, 1), datetime.date(2023, 8, 31))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(1)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-09-01
Today in mm-dd format: 09-01
yesterday: 2023-08-31 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-08-31 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period    name  shares
0       1     MCS   78000
1       1   PTTGC    6000
2       1  SINGER    6000
3       1   SYNEX   15000
4       2  AIMIRT   10000
..    ...     ...     ...
26      4     KCE   10000
27      4     PTG    3600
28      4     SCC     600
29      4    SENA  105000
30      4     TMT   36000

[31 rows x 3 columns]

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-09-01'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1        MCS      78000   22-12-30   23-09-01       8.95       6.80      -2.15     -24.02 -167,700.00        -43
         1      PTTGC       6000   22-12-30   23-09-01      47.25      37.00     -10.25     -21.69 -61,500.00        -41
         1     SINGER       6000   22-12-30   23-09-01      28.75      14.10     -14.65     -50.96 -87,900.00       -124
         1      SYNEX      15000   22-12-30   23-09-01      16.40      13.60      -2.80     -17.07 -42,000.00        -28
         2     AIMIRT      10000   22-12-30   23-09-01      12.10      10.80      -1.30     -10.74 -13,000.00        -13
         2     AIMIRT      10000   22-12-30   23-09-01      12.10      10.80      -1.30     -10.74 -13,000.00        -13
         2     AIMIRT      10000   22-12-30   23-09-01      12.10      10.80      -1.30     -10.74 -13,000.00        -13
         2        ASP      30000   22-12-30   23-09-01       2.98       2.94      -0.04      -1.34  -1,200.00         -2
         2    CPNREIT      60000   22-12-30   23-09-01      19.50      11.00      -8.50     -43.59 -510,000.00        -85
         2        DIF      30000   22-12-30   23-09-01      13.20       9.35      -3.85     -29.17 -115,500.00        -45
         2     GVREIT      42000   22-12-30   23-09-01       9.10       7.00      -2.10     -23.08 -88,200.00        -42
         2      JASIF     130000   22-12-30   23-09-01       8.05       6.75      -1.30     -16.15 -169,000.00        -26
         2        RCL      27000   22-12-30   23-09-01      30.75      21.50      -9.25     -30.08 -249,750.00        -58
         2        STA       5000   22-12-30   23-09-01      21.10      15.30      -5.80     -27.49 -29,000.00        -58
         2      TFFIF      20000   22-12-30   23-09-01       7.65       7.50      -0.15      -1.96  -3,000.00         -3
         2      WHAIR      50000   22-12-30   23-09-01       7.45       7.00      -0.45      -6.04 -22,500.00         -9
         2      WHART      20000   22-12-30   23-09-01      10.70      10.60      -0.10      -0.93  -2,000.00         -1
         3         AH       1200   22-12-30   23-09-01      29.75      36.00       6.25      21.01   7,500.00         25
         3        ASK       4500   22-12-30   23-09-01      35.50      25.25     -10.25     -28.87 -46,125.00        -41
         3        AWC       9000   22-12-30   23-09-01       6.30       4.26      -2.04     -32.38 -18,360.00        -63
         3        JMT       4200   22-12-30   23-09-01      69.00      46.25     -22.75     -32.97 -95,550.00        -91
         3        NER      27000   22-12-30   23-09-01       6.35       4.92      -1.43     -22.52 -38,610.00        -31
         3        ORI      45000   22-12-30   23-09-01      12.10      10.50      -1.60     -13.22 -72,000.00        -16
         4        BCH      15000   22-12-30   23-09-01      20.50      19.00      -1.50      -7.32 -22,500.00        -15
         4        IVL       7200   22-12-30   23-09-01      40.75      29.00     -11.75     -28.83 -84,600.00        -47
         4      JMART       6000   22-12-30   23-09-01      40.75      23.20     -17.55     -43.07 -105,300.00        -81
         4        KCE      10000   22-12-30   23-09-01      46.50      51.50       5.00      10.75  50,000.00         20
         4        PTG       3600   22-12-30   23-09-01      14.50      10.40      -4.10     -28.28 -14,760.00        -41
         4        SCC        600   22-12-30   23-09-01     342.00     312.00     -30.00      -8.77 -18,000.00        -30
         4       SENA     105000   22-12-30   23-09-01       3.94       2.86      -1.08     -27.41 -113,400.00        -54
         4        TMT      36000   22-12-30   23-09-01       7.80       7.10      -0.70      -8.97 -25,200.00        -14

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
26,4,KCE,10000,2022-12-30,2023-09-01,46.5,51.50,5.00,10.75,50000.0,20
19,3,AWC,9000,2022-12-30,2023-09-01,6.3,4.26,-2.04,-32.38,-18360.0,-63
28,4,SCC,600,2022-12-30,2023-09-01,342.0,312.00,-30.00,-8.77,-18000.0,-30
5,2,AIMIRT,10000,2022-12-30,2023-09-01,12.1,10.80,-1.30,-10.74,-13000.0,-13
23,4,BCH,15000,2022-12-30,2023-09-01,20.5,19.00,-1.50,-7.32,-22500.0,-15

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
6,2,AIMIRT,10000,2022-12-30,2023-09-01,12.10,10.80,-1.30,-10.74,-13000.0,-13
22,3,ORI,45000,2022-12-30,2023-09-01,12.10,10.50,-1.60,-13.22,-72000.0,-16
21,3,NER,27000,2022-12-30,2023-09-01,6.35,4.92,-1.43,-22.52,-38610.0,-31
24,4,IVL,7200,2022-12-30,2023-09-01,40.75,29.00,-11.75,-28.83,-84600.0,-47
12,2,RCL,27000,2022-12-30,2023-09-01,30.75,21.50,-9.25,-30.08,-249750.0,-58

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
2,1,SINGER,6000,2022-12-30,2023-09-01,28.75,14.10,-14.65,-50.96,-87900.0,-124
9,2,DIF,30000,2022-12-30,2023-09-01,13.20,9.35,-3.85,-29.17,-115500.0,-45
18,3,ASK,4500,2022-12-30,2023-09-01,35.50,25.25,-10.25,-28.87,-46125.0,-41
4,2,AIMIRT,10000,2022-12-30,2023-09-01,12.10,10.80,-1.30,-10.74,-13000.0,-13
14,2,TFFIF,20000,2022-12-30,2023-09-01,7.65,7.50,-0.15,-1.96,-3000.0,-3

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change     amount  spd
period
1       105000  101.35   71.50  -29.85  -113.74  -359100.0 -236
2       444000  166.78  131.34  -35.44  -212.05 -1229150.0 -368
3        90900  159.00  127.18  -31.82  -108.95  -263145.0 -217
4       183400  516.74  455.06  -61.68  -141.90  -333760.0 -262

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr     avr_p1     avr_p2   avr_chg    avr_spd    ttl_amt
period
1        105000  25.337500  17.875000 -7.462500 -59.000000  -359100.0
2        444000  12.829231  10.103077 -2.726154 -28.307692 -1229150.0
3         90900  26.500000  21.196667 -5.303333 -36.166667  -263145.0
4        183400  64.592500  56.882500 -7.710000 -32.750000  -333760.0

In [17]:
pl = df.amount.sum()
float_formatter.format(pl)

'฿-2,185,155.00'

In [18]:
prev_pl = -2_135_890
diff = pl - prev_pl
float_formatter.format(diff)

'฿-49,265.00'